Revit 2026 API

# ScheduleDefinitionRemoveFilter Method

---

Removes a filter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveFilter(
	int index
)
```
```vb
Public Sub RemoveFilter (
	index As Integer
)
```
```cpp
public:
void RemoveFilter(
	int index
)
```
```fsharp
member RemoveFilter :
        index : int -> unit
```

#### Parameters

index Int32
     The index of the filter to remove.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | index is not a valid filter index. |
| InvalidOperationException | This ScheduleDefinition does not support filters. |

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace